<?php

return [
    "processing" => "Подождите...",
    "search" => "Поиск:",
    "lengthMenu" => "Показать _MENU_ записей",
    "info" => "Записи с _START_ до _END_ из _TOTAL_ записей",
    "infoEmpty" => "Записи с 0 до 0 из 0 записей",
    "infoFiltered" => "(отфильтровано из _MAX_ записей)",
    "loadingRecords" => "Загрузка записей...",
    "zeroRecords" => "Записи отсутствуют.",
    "emptyTable" => "В таблице отсутствуют данные",
    "paginate" => [
        "first" => "Первая",
        "previous" => "Предыдущая",
        "next" => "Следующая",
        "last" => "Последняя"
    ],
    "aria" => [
        "sortAscending" => ": активировать для сортировки столбца по возрастанию",
        "sortDescending" => ": активировать для сортировки столбца по убыванию"
    ],
    "select" => [
        "rows" => [
            "_" => "Выбрано записей: %d",
            "Выбрана одна запись"
        ],
        "cells" => [
            "1 ячейка выбрана",
            "_" => "Выбрано %d ячеек"
        ],
        "columns" => [
            "1 столбец выбран",
            "_" => "%d столбцов выбрано"
        ],
        "selectRow" => "Выберите строку",
        "selectOneRow" => "Выберите одну строку",
    ],
    "searchBuilder" => [
        "conditions" => [
            "string" => [
                "startsWith" => "Начинается с",
                "contains" => "Содержит",
                "empty" => "Пусто",
                "endsWith" => "Заканчивается на",
                "equals" => "Равно",
                "not" => "Не",
                "notEmpty" => "Не пусто",
                "notContains" => "Не содержит",
                "notStarts" => "Не начинается на",
                "notEnds" => "Не заканчивается на"
            ],
            "date" => [
                "after" => "После",
                "before" => "До",
                "between" => "Между",
                "empty" => "Пусто",
                "equals" => "Равно",
                "not" => "Не",
                "notBetween" => "Не между",
                "notEmpty" => "Не пусто"
            ],
            "number" => [
                "empty" => "Пусто",
                "equals" => "Равно",
                "gt" => "Больше чем",
                "gte" => "Больше, чем равно",
                "lt" => "Меньше чем",
                "lte" => "Меньше, чем равно",
                "not" => "Не",
                "notEmpty" => "Не пусто",
                "between" => "Между",
                "notBetween" => "Не между ними"
            ],
            "array" => [
                "equals" => "Равно",
                "empty" => "Пусто",
                "contains" => "Содержит",
                "not" => "Не равно",
                "notEmpty" => "Не пусто",
                "without" => "Без"
            ]
        ],
        "data" => "Данные",
        "deleteTitle" => "Удалить условие фильтрации",
        "logicAnd" => "И",
        "logicOr" => "Или",
        "title" => [
            "Конструктор поиска",
            "_" => "Конструктор поиска (%d)"
        ],
        "value" => "Значение",
        "add" => "Добавить условие",
        "button" => [
            "Конструктор поиска",
            "_" => "Конструктор поиска (%d)"
        ],
        "clearAll" => "Очистить всё",
        "condition" => "Условие",
        "leftTitle" => "Превосходные критерии",
        "rightTitle" => "Критерии отступа"
    ],
    "searchPanes" => [
        "clearMessage" => "Очистить всё",
        "collapse" => [
            "Панели поиска",
            "_" => "Панели поиска (%d)"
        ],
        "count" => "{total}",
        "countFiltered" => "{shown} ({total})",
        "emptyPanes" => "Нет панелей поиска",
        "loadMessage" => "Загрузка панелей поиска",
        "title" => "Фильтры активны - %d",
        "showMessage" => "Показать все",
        "collapseMessage" => "Скрыть все"
    ],
    "thousands" => ",",
    "buttons" => [
        "pageLength" => [
            "_" => "Показать 10 строк",
            "Показать все ряды"
        ],
        "pdf" => "PDF",
        "print" => "Печать",
        "collection" => "Коллекция <span class=\"ui-button-icon-primary ui-icon ui-icon-triangle-1-s\"></span>",
        "colvis" => "Видимость столбцов",
        "colvisRestore" => "Восстановить видимость",
        "copy" => "Копировать",
        "copyKeys" => "Нажмите ctrl or u2318 + C, чтобы скопировать данные таблицы в буфер обмена.  Для отмены, щелкните по сообщению или нажмите escape.",
        "copySuccess" => [
            "Скопирована 1 ряд в буфер обмена",
            "_" => "Скопировано %ds рядов в буфер обмена"
        ],
        "copyTitle" => "Скопировать в буфер обмена",
        "csv" => "CSV",
        "excel" => "Excel"
    ],
    "decimal" => ".",
    "infoThousands" => ",",
    "autoFill" => [
        "cancel" => "Отменить",
        "fill" => "Заполнить все ячейки <i>%d<i></i></i>",
        "fillHorizontal" => "Заполнить ячейки по горизонтали",
        "fillVertical" => "Заполнить ячейки по вертикали"
    ],
    "datetime" => [
        "previous" => "Предыдущий",
        "next" => "Следующий",
        "hours" => "Часы",
        "minutes" => "Минуты",
        "seconds" => "Секунды",
        "unknown" => "Неизвестный",
        "amPm" => [
            "AM",
            "PM"
        ],
        "months" => [
            "Январь",
            "Февраль",
            "Ноябрь",
            "Декабрь",
            "Март",
            "Апрель",
            "Май",
            "Июнь",
            "Июль",
            "Август",
            "Сентябрь",
            "Октябрь"
        ],
        "weekdays" => [
            "Вс",
            "Пн",
            "Вт",
            "Ср",
            "Чт",
            "Пт",
            "Сб"
        ]
    ],
    "editor" => [
        "close" => "Закрыть",
        "create" => [
            "button" => "Новый",
            "title" => "Создать новую запись",
            "submit" => "Создать"
        ],
        "edit" => [
            "button" => "Изменить",
            "title" => "Изменить запись",
            "submit" => "Изменить"
        ],
        "remove" => [
            "button" => "Удалить",
            "title" => "Удалить",
            "submit" => "Удалить",
            "confirm" => [
                "_" => "Вы точно хотите удалить %d строк?",
                "Вы точно хотите удалить 1 строку?"
            ]
        ],
        "multi" => [
            "restore" => "Отменить изменения",
            "title" => "Несколько значений",
            "noMulti" => "Это поле должно редактироватся отдельно, а не как часть групы"
        ],
        "error" => [
            "system" => "Возникла системная ошибка (<a target=\"\" rel=\"nofollow\" href=\"\">Подробнее</a>)"
        ]
    ],
    "searchPlaceholder" => "Что ищете?",
    "ajaxError" => "Невозможно загрузить данные. Проверьте наличие соединения или обратитесь в службу поддержки.",
];

